RIET/src/Catalogs/SoldTo/SoldTo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SoldTo</name>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>Address1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ParentCompanyForPayments</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>Lawson</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NameForMoveIt</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UseFiscalClassificationOfItems</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>StartOfExportToTMS</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Leg7LegalEntityDetermining</name>
    <type>
      <types>EnumRef.Leg7LegalEntityDetermining</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalEntityForLeg7</name>
    <type>
      <types>CatalogRef.LegalEntities</types>
    </type>
  </attributes>
  <attributes>
    <name>NameRus</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Prefix</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PostalAddressForInvoiceAndSupportingDocuments</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PostalAddressForInvoiceAndSupportingDocumentsRus</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HOB</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Enums/Leg7LegalEntityDetermining/Leg7LegalEntityDetermining.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Leg7LegalEntityDetermining</name>
  <enumValues>
    <name>FiscalRegistration</name>
  </enumValues>
  <enumValues>
    <name>DefaultLegalEntity</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Catalogs/SoldTo/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	ДозаполнитьРеквизитыБезДополнительныхДанных();
	
	ПроверитьЗаполнениеРеквизитов(Отказ);
		
КонецПроцедуры

Процедура ДозаполнитьРеквизитыБезДополнительныхДанных()
	
	Наименование = СокрЛП(Наименование);
	Address1 = СокрЛП(Address1);
	NameForMoveIt = СокрЛП(NameForMoveIt);
	CompanyNo = СокрЛП(CompanyNo);
	NameRus = СокрЛП(NameRus);
	PostalAddressForInvoiceAndSupportingDocuments = СокрЛП(PostalAddressForInvoiceAndSupportingDocuments);
	PostalAddressForInvoiceAndSupportingDocumentsRus = СокрЛП(PostalAddressForInvoiceAndSupportingDocumentsRus);
	
	Если НЕ ЗначениеЗаполнено(ParentCompanyForPayments) Тогда
		
		Если ЭтоНовый() Тогда
			УстановитьСсылкуНового(Справочники.SoldTo.ПолучитьСсылку());
			ParentCompanyForPayments = ПолучитьСсылкуНового();
		Иначе
			ParentCompanyForPayments = Ссылка;
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры 

Процедура ПроверитьЗаполнениеРеквизитов(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СокрЛП(Код)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Code' is empty!",
			ЭтотОбъект, "Код", , Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Name' is empty!",
			ЭтотОбъект, "Наименование", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Country) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Country' is empty!",
			ЭтотОбъект, "Country", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Address1) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Address 1' is empty!",
			ЭтотОбъект, "Address1", , Отказ);
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ParentCompanyForPayments) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Parent co. for payments' is empty!",
			ЭтотОбъект, "ParentCompanyForPayments", , Отказ);	
	КонецЕсли;
	
	Если Lawson Тогда
		
		Если НЕ ЗначениеЗаполнено(CompanyNo) Тогда	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"'Company no.' is empty!",
				ЭтотОбъект, "CompanyNo", , Отказ);	
		КонецЕсли;
		
	КонецЕсли;
	
	Если Leg7LegalEntityDetermining = Перечисления.Leg7LegalEntityDetermining.DefaultLegalEntity
		И Не ЗначениеЗаполнено(LegalEntityForLeg7) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"'Default Legal entity' is empty!",
			ЭтотОбъект, "LegalEntityForLeg7", , Отказ);
	КонецЕсли;
	
КонецПроцедуры
